/*     */ package com.lbs.globalization;
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ public class JLbsCultureInfoARSA
/*     */   extends JLbsCultureInfoARBase
/*     */ {
/*     */   private static final long serialVersionUID = 1L;
/*     */   
/*     */   public String getLanguagePrefix() {
/*  20 */     return "ARSA";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getCultureResStr(int cultureResID) {
/*  25 */     switch (cultureResID) {
/*     */       
/*     */       case 101:
/*  28 */         return "عربي";
/*     */       case 102:
/*  30 */         return "اسم المستخدم";
/*     */       case 103:
/*  32 */         return "كلمة المرور";
/*     */       case 104:
/*  34 */         return "الشركة";
/*     */       case 105:
/*  36 */         return "الفترة";
/*     */       case 106:
/*  38 */         return "اللغة";
/*     */       case 107:
/*  40 */         return "&موافق";
/*     */       case 108:
/*  42 */         return "&الغاءالأمر";
/*     */       case 109:
/*  44 */         return "الشركة والفترة";
/*     */       case 110:
/*  46 */         return "الشعبة";
/*     */       
/*     */       case 1000:
/*  49 */         return "خطأ";
/*     */       case 1001:
/*  51 */         return "اسم المستخدم و/ أَو كلمة سر غير صحيحه. الرجاء الاتصال بمدير نظامكَ.";
/*     */       case 1002:
/*  53 */         return "ليس لديك الامتيازات الاداريه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1003:
/*  55 */         return "يجب تحديث جداول شركة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1004:
/*  57 */         return "انت لم تسمح لهم باستخدام هذه الشركة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1005:
/*  59 */         return "الفترة المحددة لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1006:
/*  61 */         return "فترة نشطة لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1007:
/*  63 */         return "نظام الجداول والطلب من نسخة مختلفة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1008:
/*  65 */         return "الشركة المحدّدة لم يتم العثور عليهاَ. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1009:
/*  67 */         return "نظام الجداول لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1010:
/*  69 */         return "فشل تسجيل الدخول. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1011:
/*  71 */         return "حساب المستخدم مغلق. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1012:
/*  73 */         return "رقم IP غير متاح. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1013:
/*  75 */         return "كلمة السر الخاصة بك قد انتهت صلاحيتها. الرجاء تحديث كلمة السر الخاصة بك.";
/*     */       case 1014:
/*  77 */         return "خطأ في الاتصال بقاعدة البيانات . الرجاء التحقق من إعدادات الاتصال بقاعدة بيانات.";
/*     */       case 1015:
/*  79 */         return "ينبغي تحديث جداول الفترة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1016:
/*  81 */         return "يرجى تحديد الشركة التي تود دخول اليها.";
/*     */       case 1017:
/*  83 */         return "نظام الجداول قد يكون من النسخه القديمة. الرجاء تحديث وحاول مرة أخرى.";
/*     */       case 1018:
/*  85 */         return "خطأ في تسجيل الدخول";
/*     */       case 1019:
/*  87 */         return "غير قادر على انشاء قناة.";
/*     */       case 1020:
/*  89 */         return "تعذر الاتصال على العنوان التالي :";
/*     */       case 1021:
/*  91 */         return "هذا ليس صحيحا ادخل العنوان :";
/*     */       case 1022:
/*  93 */         return "الإستثناء الداخلي:";
/*     */       case 1023:
/*  95 */         return "الإستثناء البعيد:";
/*     */       case 1024:
/*  97 */         return "الإستثناءرفع بالرمزِ:";
/*     */       case 120:
/*  99 */         return "متقدم";
/*     */       case 1040:
/* 101 */         return "وأجبت على السؤال بشكل غير صحيح. يرجى المحاولة مرة أخرى.";
/*     */     } 
/* 103 */     return super.getCultureResStr(cultureResID);
/*     */   }
/*     */ 
/*     */   
/*     */   public int getCurrencyIdx() {
/* 108 */     return 18;
/*     */   }
/*     */ }


/* Location:              C:\Users\Furkan\Desktop\logo\Components.jar!\com\lbs\globalization\JLbsCultureInfoARSA.class
 * Java compiler version: 8 (52.0)
 * JD-Core Version:       1.1.3
 */