/*     */ package com.lbs.globalization;
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ public class JLbsCultureInfoAREG
/*     */   extends JLbsCultureInfoARBase
/*     */ {
/*     */   private static final long serialVersionUID = 1L;
/*     */   
/*     */   public String getLanguagePrefix() {
/*  19 */     return "AREG";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getCultureResStr(int cultureResID) {
/*  24 */     switch (cultureResID) {
/*     */       
/*     */       case 101:
/*  27 */         return "عربي";
/*     */       case 102:
/*  29 */         return "اسم المستخدم";
/*     */       case 103:
/*  31 */         return "كلمة المرور";
/*     */       case 119:
/*  33 */         return "تسجيل الدخول ب حساب اخر / مسٌتخدم أخرً";
/*     */       case 104:
/*  35 */         return "الشركة";
/*     */       case 105:
/*  37 */         return "الفترة";
/*     */       case 106:
/*  39 */         return "اللغة";
/*     */       case 107:
/*  41 */         return "&موافق";
/*     */       case 108:
/*  43 */         return "&الغاءالأمر";
/*     */       case 109:
/*  45 */         return "الشركة والفترة";
/*     */       case 110:
/*  47 */         return "الشعبة";
/*     */       case 111:
/*  49 */         return "مفتاح Caps Lock مفعل.";
/*     */       case 1000:
/*  51 */         return "خطأ";
/*     */       case 1001:
/*  53 */         return "اسم المستخدم و/ أَو كلمة سر غير صحيحه. الرجاء الاتصال بمدير نظامكَ.";
/*     */       case 1002:
/*  55 */         return "ليس لديك الامتيازات الاداريه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1003:
/*  57 */         return "يجب تحديث جداول الشركة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1036:
/*  59 */         return "يجب ان يتم ترقيه مشُغلات الفتره . برجاء الاتصال بمسئول النظام";
/*     */       case 1035:
/*  61 */         return "يجب ان يتم ترقيه مشُغلات الشركة . برجاء الاتصال بمسئول النظام";
/*     */       case 1004:
/*  63 */         return "انت لم يسمح لك باستخدام هذه الشركة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1005:
/*  65 */         return "الفترة المحددة لا يمكن العثور عليها. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1006:
/*  67 */         return "فترة نشطة لا يمكن العثور عليها. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1007:
/*  69 */         return "نظام الجداول والطلب من نسخة مختلفة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1008:
/*  71 */         return "الشركة المحدّدة لم يتم العثور عليهاَ. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1009:
/*  73 */         return "نظام الجداول لا يمكن العثور عليها. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1010:
/*  75 */         return "فشل تسجيل الدخول. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1011:
/*  77 */         return "حساب المستخدم مغلق. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1012:
/*  79 */         return "رقم IP غير متاح. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1013:
/*  81 */         return "كلمة السر الخاصة بك قد انتهت صلاحيتها. الرجاء تحديث كلمة السر الخاصة بك.";
/*     */       case 1014:
/*  83 */         return "خطأ في الاتصال بقاعدة البيانات . الرجاء التحقق من إعدادات الاتصال بقاعدة بيانات.";
/*     */       case 1015:
/*  85 */         return "ينبغي تحديث جداول الفترة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1016:
/*  87 */         return "يرجى تحديد الشركة التي تود الدخول اليها.";
/*     */       case 1017:
/*  89 */         return "نظام الجداول قد يكون من النسخه القديمة. الرجاء تحديث وحاول مرة أخرى.";
/*     */       case 1018:
/*  91 */         return "خطأ في تسجيل الدخول";
/*     */       case 1019:
/*  93 */         return "غير قادر على انشاء اتصال.";
/*     */       case 1020:
/*  95 */         return "تعذر الاتصال على العنوان التالي :";
/*     */       case 1021:
/*  97 */         return "هذا ليس صحيحا ادخل العنوان الصحيح :";
/*     */       case 1022:
/*  99 */         return "الإستثناء الداخلي:";
/*     */       case 1023:
/* 101 */         return "الإستثناء البعيد:";
/*     */       case 1024:
/* 103 */         return "الإستثناءرفع بالرمزِ:";
/*     */       case 1025:
/* 105 */         return "ليس لديك ترخيص صالح لاستخدام هذا التطبيق. \\ برجاء الحصول على رخصة سارية المفعول لتثبيت!";
/*     */       case 120:
/* 107 */         return "متقدم";
/*     */       case 1040:
/* 109 */         return "وأجبت على السؤال بشكل غير صحيح. يرجى المحاولة مرة أخرى.";
/*     */       case 1026:
/* 111 */         return "الترخيص الخاص بك لا يتضمن هذه اللغة";
/*     */       case 1027:
/* 113 */         return "الترخيص الخاص بك إنتهت فترة صلاحيته!";
/*     */       case 1028:
/* 115 */         return "رخصه الاستخدام الخاصه بكٍ لا تدعم نظام التشغيل الذي تَستخدمه . برجاء الرجوع الي الانظمه التي تدعمها رخصتنا.";
/*     */       case 1029:
/* 117 */         return "الرخصة الخاصة بك لا تدعم ادارة قواعد البيانات";
/*     */       case 1039:
/* 119 */         return "لقد وصلت لاقصي عدد من المستخدمين الخاص بالرخصه الخاصة بك. لايمكنك الدخول الي البرنامج";
/*     */       case 1030:
/* 121 */         return "ا يمكن إنشاء جلسة عمل جديدة! تم حظر دخول المستخدم!";
/*     */       case 1031:
/* 123 */         return "يجب ترقية الجداول الخاصة. يرجى الاتصال بمسئول النظام.";
/*     */       case 1032:
/* 125 */         return "يوجد عارض تقارير اخر قيد الاستخدام الان / برجاء الضغط علي زر فتح من تقرير لوجو لعرض تقرير اخر";
/*     */       case 1033:
/* 127 */         return "حدث خطأ في الوصول الي العميل . برجاء التواصل مع مسئول النظام";
/*     */       case 1034:
/* 129 */         return "حزمة التخصيص غير صالحة. يرجى الاتصال بمسئول النظام.";
/*     */       case 112:
/* 131 */         return "نسيت معلومات تسجيل الدخول";
/*     */       case 113:
/* 133 */         return "عنوان البريد الإلكتروني";
/*     */       case 114:
/* 135 */         return "تم إرسال معلومات تسجيل الدخول الخاصة بك إلى عنوان البريد الإلكتروني الخاص بك.";
/*     */       case 116:
/* 137 */         return "لم يتم تسجيل هذا العنوان الإلكتروني في نظامنا. حاول مرة اخرى.";
/*     */       case 117:
/* 139 */         return "حدث خطأ غير متوقع. يرجى الاتصال بمسؤول النظام.";
/*     */       case 118:
/* 141 */         return "معلومات";
/*     */       case 1037:
/* 143 */         return "معلومات المستخدم الاخر غير صحيحه.";
/*     */       case 1038:
/* 145 */         return "تعريفات قاعدة بيانات إدارة العمليات غير محدثة إلى اخر تاريخ  يرجى الاتصال بمسئول النظام.";
/*     */       case 1041:
/* 147 */         return "يجب إدخال كلمة المرور.";
/*     */       case 1064:
/* 149 */         return "لا تمتلك تعريف للقائمة في حزمة الترخيص الخاص بك. لا يمكنك الدخول إلى النظام!";
/*     */       case 1065:
/* 151 */         return "لم يتم تحديد رقم التعريف في النظام!";
/*     */       case 1066:
/* 153 */         return "لا يمكن التحقق من التوقيع الرقمي!";
/*     */       case 1067:
/* 155 */         return "التوقيع الرقمي غير صالح!";
/*     */       case 1068:
/* 157 */         return "لا يوجد رخصة مفعله للمستخدم الخاص بك!";
/*     */       case 1043:
/* 159 */         return "الترخيص الخاص بك لا يدعم الدخول لهذا النوع من المستخدم. لا يمكنك الدخول إلى النظام!";
/*     */     } 
/*     */     
/* 162 */     return super.getCultureResStr(cultureResID);
/*     */   }
/*     */ 
/*     */   
/*     */   public int getCurrencyIdx() {
/* 167 */     return 46;
/*     */   }
/*     */ }


/* Location:              C:\Users\Furkan\Desktop\logo\Components.jar!\com\lbs\globalization\JLbsCultureInfoAREG.class
 * Java compiler version: 8 (52.0)
 * JD-Core Version:       1.1.3
 */