/*     */ package com.lbs.globalization;
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ public class JLbsCultureInfoARJO
/*     */   extends JLbsCultureInfoARSA
/*     */ {
/*     */   private static final long serialVersionUID = 1L;
/*     */   
/*     */   public String getLanguagePrefix() {
/*  20 */     return "ARJO";
/*     */   }
/*     */ 
/*     */ 
/*     */   
/*     */   public int getCurrencyIdx() {
/*  26 */     return 54;
/*     */   }
/*     */ 
/*     */ 
/*     */   
/*     */   public String getCultureResStr(int cultureResID) {
/*  32 */     switch (cultureResID) {
/*     */       
/*     */       case 101:
/*  35 */         return "عربي";
/*     */       case 102:
/*  37 */         return "اسم المستخدم";
/*     */       case 103:
/*  39 */         return "كلمة المرور";
/*     */       case 104:
/*  41 */         return "الشركة";
/*     */       case 105:
/*  43 */         return "الفترة";
/*     */       case 106:
/*  45 */         return "اللغة";
/*     */       case 107:
/*  47 */         return "&موافق";
/*     */       case 108:
/*  49 */         return "&الغاءالأمر";
/*     */       case 109:
/*  51 */         return "الشركة والفترة";
/*     */       case 110:
/*  53 */         return "الشعبة";
/*     */       
/*     */       case 1000:
/*  56 */         return "خطأ";
/*     */       case 1001:
/*  58 */         return "اسم المستخدم و/ أَو كلمة سر غير صحيحه. الرجاء الاتصال بمدير نظامكَ.";
/*     */       case 1002:
/*  60 */         return "ليس لديك الامتيازات الاداريه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1004:
/*  62 */         return "انت لم تسمح لهم باستخدام هذه الشركة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1005:
/*  64 */         return "الفترة المحددة لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1006:
/*  66 */         return "فترة نشطة لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1007:
/*  68 */         return "نظام الجداول والطلب من نسخة مختلفة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1008:
/*  70 */         return "الشركة المحدّدة لم يتم العثور عليهاَ. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1009:
/*  72 */         return "نظام الجداول لا يمكن العثور عليه. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1010:
/*  74 */         return "فشل تسجيل الدخول. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1011:
/*  76 */         return "حساب المستخدم مغلق. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1012:
/*  78 */         return "رقم IP غير متاح. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1013:
/*  80 */         return "كلمة السر الخاصة بك قد انتهت صلاحيتها. الرجاء تحديث كلمة السر الخاصة بك.";
/*     */       case 1014:
/*  82 */         return "خطأ في الاتصال بقاعدة البيانات . الرجاء التحقق من إعدادات الاتصال بقاعدة بيانات.";
/*     */       case 1015:
/*  84 */         return "ينبغي تحديث جداول الفترة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1016:
/*  86 */         return "يرجى تحديد الشركة التي تود دخول اليها.";
/*     */       case 1017:
/*  88 */         return "نظام الجداول قد يكون من النسخه القديمة. الرجاء تحديث وحاول مرة أخرى.";
/*     */       case 1018:
/*  90 */         return "خطأ في تسجيل الدخول";
/*     */       case 1019:
/*  92 */         return "غير قادر على انشاء قناة.";
/*     */       case 1020:
/*  94 */         return "تعذر الاتصال على العنوان التالي :";
/*     */       case 1021:
/*  96 */         return "هذا ليس صحيحا ادخل العنوان :";
/*     */       case 1022:
/*  98 */         return "الإستثناء الداخلي:";
/*     */       case 1023:
/* 100 */         return "الإستثناء البعيد:";
/*     */       case 1024:
/* 102 */         return "الإستثناءرفع بالرمزِ:";
/*     */       case 120:
/* 104 */         return "متقدم";
/*     */       case 1040:
/* 106 */         return "وأجبت على السؤال بشكل غير صحيح. يرجى المحاولة مرة أخرى.";
/*     */       case 119:
/* 108 */         return "تغيير المستخدم";
/*     */       case 111:
/* 110 */         return "Caps Lock فعال";
/*     */       case 1003:
/* 112 */         return "يجب تحديث معلومات الشركة , الرجاء الاتصال بمسؤول النظام";
/*     */ 
/*     */ 
/*     */ 
/*     */       
/*     */       case 1025:
/* 118 */         return "لا يوجد لديك ترخيص لاستخدام هذا البرنامج , يجب الحصول على رخصة سارية المفعول لتثبيت البرنامج";
/*     */       case 1026:
/* 120 */         return "هذه الرخصة لا تحوي هذه اللغة";
/*     */       case 1027:
/* 122 */         return "هذه الرخصة منتهية الصلاحية";
/*     */       case 1028:
/* 124 */         return "نظام التشغيل غير مشمول في هذه الرخصة , يرجى الرجوع إلى اتفاقية الترخيص الخاصة بك لأنظمة التشغيل المعتمدة!";
/*     */       case 1029:
/* 126 */         return "هذه الرخصة لا تحتوي على نظام ادارة قاعدة البيانات";
/*     */       case 1039:
/* 128 */         return "نسخة المستخدم وصلت الى حدها الاعلى , لا يمكنك الدخول الى البرنامج";
/*     */       case 1030:
/* 130 */         return "لا يمكن إنشاء واجهة المستخدم الجديدة! تم حظر دخول المستخدم!";
/*     */       case 1031:
/* 132 */         return "يجب تحديث جداول التخصيص. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1032:
/* 134 */         return " \"LOGO Report Viewer\"  التطبيق قيد الاستخدام في الوقت الحالي. الرجاء النقر على زر \"Open\" button located on \"Logo Report Viewer\" لمشاهدة تقرير اخر";
/*     */       case 1033:
/* 136 */         return "خطأ في توافق العميل. يرجى الاتصال بمسؤول النظام.";
/*     */       case 1034:
/* 138 */         return "حزمة التخصيص غير صالحة. يرجى الاتصال بمسؤول النظام.";
/*     */       case 112:
/* 140 */         return "نسيت معلومات الدخول الخاص بي";
/*     */       case 113:
/* 142 */         return "البريد الالكتروني";
/*     */       case 114:
/* 144 */         return "الرجاء ادخال بريد الكتروني صحيح";
/*     */       case 115:
/* 146 */         return "معلومات الدخول الخاصة بك تم ارسالها الى بريدك الالكتروني";
/*     */       case 116:
/* 148 */         return "هذا الايميل غير مسجل في النظام، جرب مرة أخرى";
/*     */       case 117:
/* 150 */         return "حدث خطأ غير متوقع. يرجى الاتصال بمسؤول النظام.";
/*     */       case 118:
/* 152 */         return "معلومات";
/*     */       case 1037:
/* 154 */         return "معلومات مستخدم اخر غير متاحه";
/*     */       case 1038:
/* 156 */         return "تعريفات قاعدة بيانات ادارة العمليات قديمة، يرجى مراجعة مسؤول النظام";
/*     */       case 1041:
/* 158 */         return "يجب ادخال كلمه السر";
/*     */       case 1064:
/* 160 */         return "لا يوجد تعريفات للقوائم في الرخصة، لا يمكنك الدخول للنظام!";
/*     */       case 1065:
/* 162 */         return "رقم التعريف غير معرف في النظام";
/*     */       case 1066:
/* 164 */         return "لا يمكن التحقق من التوقيع الرقمي!";
/*     */       case 1067:
/* 166 */         return "التوقيع الرقمي  غير صالح!";
/*     */       case 1068:
/* 168 */         return "لا يوجد رخصة معرفة لهذا المستخدم!";
/*     */       case 1043:
/* 170 */         return "الترخيص الخاص بك لا يدعم الدخول لهذا النوع من المستخدم. لا يمكنك الدخول إلى النظام!";
/*     */     } 
/* 172 */     return super.getCultureResStr(cultureResID);
/*     */   }
/*     */ }


/* Location:              C:\Users\Furkan\Desktop\logo\Components.jar!\com\lbs\globalization\JLbsCultureInfoARJO.class
 * Java compiler version: 8 (52.0)
 * JD-Core Version:       1.1.3
 */