/*     */ package com.lbs.globalization;
/*     */ 
/*     */ import java.awt.Font;
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ public class JLbsCultureInfoTHTH
/*     */   extends JLbsDefaultCultureInfo
/*     */ {
/*     */   private static final long serialVersionUID = 1L;
/*  18 */   public static final String[] MONTHNAMES = new String[] { "โมฆะ", "มกราคม", "กุมภาพันธ์", "มีนาคม", "เมษายน", "พฤษภาคม", "มิถุนายน", "กรกฎาคม", 
/*  19 */       "สิงหาคม", "กันยายน", "ตุลาคม", "พฤศจิกายน", "ธันวาคม" };
/*     */   
/*  21 */   public static final String[] DAYNAMES = new String[] { "โมฆะ", "วันอาทิตย์", "วันจันทร์", "วันอังคาร", "วันพุธ", "วันพฤหัสบดี", "วันศุกร์", "วันเสาร์" };
/*     */   
/*  23 */   public static final String[] SHORTDAYNAMES = new String[] { "โมฆ", "วันอ", "วันจั", "วันอั", "วันพุ", "วันพ", "วันศุ", "วันเ" };
/*     */   
/*  25 */   protected static final String[] NUMBERNAMES = new String[] { "[0] ศูนย์", "[1] หนึ่ง", "[2] สอง", "[3] สาม", "[4] สี่", "[5] ห้า", "[6] หก", 
/*  26 */       "[7] เจ็ด", "[8] แปด", "[9] เก้า", "[10] สิบ", "[20] ยี่สิบ", "[30] สามสิบ", "[40] สี่สิบ", "[50] ห้าสิบ", "[60] หกสิบ", 
/*  27 */       "[70] เจ็ดสิบ", "[80] แปดสิบ", "[90] เก้าสิบ", "[100] หนึ่งร้อย" };
/*     */   
/*  29 */   protected static final String[] GROUPNAMES = new String[] { "[0] ~", "[1] ~|พัน|", "[2] ~|ล้าน|", "[3] ~|พันล้าน|", "[4] ~|ล้านล้าน|", "[11001] หนึ่งร้อย|" };
/*     */   
/*  31 */   protected static final String[] BASECOMBINATIONS = new String[] { "[1] ~|ร้อย", "[2] ~|#", "[3] ~|#" };
/*     */   
/*  33 */   public static String ms_FontName = "Cordia New";
/*     */   
/*  35 */   public static int ms_FontStyle = 0;
/*     */   
/*  37 */   public static int ms_FontSize = 15;
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */   
/*     */   public String getLanguagePrefix() {
/*  46 */     return ILbsCultureConstants.LANGUAGEPREFIXES[35];
/*     */   }
/*     */ 
/*     */   
/*     */   public String getDebitText() {
/*  51 */     return "(ห)";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getCreditText() {
/*  56 */     return "(ลู)";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getEra(int iEra) {
/*  61 */     return (iEra > 0) ? 
/*  62 */       "BC" : 
/*  63 */       "AD";
/*     */   }
/*     */ 
/*     */   
/*     */   protected String[] getFormatStrings() {
/*  68 */     return DEFAULTFORMATS;
/*     */   }
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */   
/*     */   public String getMonthFullName(int iMonth) {
/*  76 */     if (iMonth > 0 && iMonth <= 12)
/*  77 */       return MONTHNAMES[iMonth]; 
/*  78 */     return MONTHNAMES[0];
/*     */   }
/*     */ 
/*     */   
/*     */   public String getDayShortName(int iDay) {
/*  83 */     if (iDay > 0 && iDay <= 7)
/*  84 */       return SHORTDAYNAMES[iDay]; 
/*  85 */     return "XxX";
/*     */   }
/*     */ 
/*     */ 
/*     */ 
/*     */ 
/*     */   
/*     */   public String getDayFullName(int iDay) {
/*  93 */     if (iDay > 0 && iDay <= 7)
/*  94 */       return DAYNAMES[iDay]; 
/*  95 */     return DAYNAMES[0];
/*     */   }
/*     */ 
/*     */   
/*     */   public String[] getNumberNames() {
/* 100 */     return NUMBERNAMES;
/*     */   }
/*     */ 
/*     */   
/*     */   public String[] getGroupNames() {
/* 105 */     return GROUPNAMES;
/*     */   }
/*     */ 
/*     */   
/*     */   public String[] getBaseCombinations() {
/* 110 */     return BASECOMBINATIONS;
/*     */   }
/*     */ 
/*     */   
/*     */   public String getYes() {
/* 115 */     return "ใช่";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getNo() {
/* 120 */     return "ไม่";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getOK() {
/* 125 */     return "ดีแล้ว";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getCancel() {
/* 130 */     return "ยกเลิก";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getSave() {
/* 135 */     return "ประหยัด";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getTimeZone() {
/* 140 */     return "โซนเวลา";
/*     */   }
/*     */ 
/*     */   
/*     */   public String getCultureResStr(int cultureResID) {
/* 145 */     switch (cultureResID) {
/*     */       
/*     */       case 101:
/* 148 */         return "ภาษาไทย";
/*     */       case 102:
/* 150 */         return "ชื่อผู้ใช้";
/*     */       case 103:
/* 152 */         return "รหัสผ่าน";
/*     */       case 119:
/* 154 */         return "เข้าสู่ระบบเป็นผู้ใช้ที่แตกต่างกัน";
/*     */       case 120:
/* 156 */         return "สูง";
/*     */       case 104:
/* 158 */         return "บริษัท";
/*     */       case 105:
/* 160 */         return "ระยะเวลา";
/*     */       case 106:
/* 162 */         return "ภาษา";
/*     */       case 107:
/* 164 */         return "&ดีแล้ว";
/*     */       case 108:
/* 166 */         return "&ยกเลิก";
/*     */       case 109:
/* 168 */         return "บริษัท และระยะเวลา";
/*     */       case 110:
/* 170 */         return "บริษัท สาขา";
/*     */       case 111:
/* 172 */         return "Caps Lock อยู่บน";
/*     */       
/*     */       case 1000:
/* 175 */         return "ความผิดพลาด";
/*     */       case 1001:
/* 177 */         return "ที่ไม่ถูกต้องชื่อผู้ใช้และ / หรือรหัสผ่าน กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1002:
/* 179 */         return "คุณไม่ได้มีสิทธิ์ระดับผู้ดูแล กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1003:
/* 181 */         return "ตาราง บริษัท ควรจะปรับ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1004:
/* 183 */         return "คุณยังไม่ได้รับอนุญาตให้ใช้ บริษัท นี้ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1005:
/* 185 */         return "ระยะเวลาที่กำหนดไม่พบ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1006:
/* 187 */         return "ระยะเวลาใช้งานไม่สามารถพบได้ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1007:
/* 189 */         return "ตารางระบบและการประยุกต์ใช้เป็นของรุ่นที่แตกต่างกัน กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1008:
/* 191 */         return "บริษัท ที่ระบุไม่พบ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1009:
/* 193 */         return "ตารางระบบไม่พบ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1010:
/* 195 */         return "ผู้ใช้ไม่สามารถเข้ากรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1011:
/* 197 */         return "บัญชีผู้ใช้ถูกบล็อก กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1012:
/* 199 */         return "ที่ไม่ถูกต้อง IP ไม่ได้ กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1013:
/* 201 */         return "รหัสผ่านของคุณหมดอายุแล้ว กรุณาติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1014:
/* 203 */         return "ข้อผิดพลาดการเชื่อมต่อฐานข้อมูล ตรวจสอบการตั้งฐานข้อมูล";
/*     */       case 1015:
/* 205 */         return "ตารางระยะเวลาควรจะปรับ โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1036:
/* 207 */         return "เรียกช่วงเวลาควรจะปรับ โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1035:
/* 209 */         return "เรียก บริษัท ควรจะปรับ โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1016:
/* 211 */         return "เลือก บริษัท ที่คุณต้องการในการทำงาน!";
/*     */       case 1017:
/* 213 */         return "รุ่นของตารางระบบอาจจะเก่า โปรดอัปเดตและลองอีกครั้ง";
/*     */       case 1018:
/* 215 */         return "เข้าสู่ระบบล้มเหลว";
/*     */       case 1019:
/* 217 */         return "ผู้ให้บริการช่องทางไม่สามารถที่จะสร้างช่อง";
/*     */       case 1020:
/* 219 */         return "สามารถเชื่อมต่อกับ ";
/*     */       case 1021:
/* 221 */         return "ที่อยู่ไม่ได้เป็น URI เข้าสู่ระบบที่ถูกต้อง: ";
/*     */       case 1022:
/* 223 */         return "ยกเว้นชั้น:\n";
/*     */       case 1023:
/* 225 */         return "ยกเว้นระยะไกล:\n";
/*     */       case 1024:
/* 227 */         return "ยกเว้นการเลี้ยงดูด้วยรหัส ";
/*     */       case 1025:
/* 229 */         return "คุณไม่ได้มีใบอนุญาตถูกต้องติดตั้ง\nกรุณาติดตั้งใบอนุญาตถูกต้อง!";
/*     */       case 1026:
/* 231 */         return "ใบอนุญาตของคุณไม่ได้มีภาษาโปรแกรมนี้!";
/*     */       case 1027:
/* 233 */         return "ใบอนุญาตของคุณหมดอายุ!";
/*     */       case 1028:
/* 235 */         return "ระบบปฏิบัติการไม่ได้รับการสนับสนุนโดยใบอนุญาตของคุณ! โปรดดูที่ข้อตกลงใบอนุญาตของคุณสำหรับการสนับสนุนระบบปฏิบัติการ!";
/*     */       case 1029:
/* 237 */         return "ใบอนุญาตของคุณไม่ได้มีระบบการจัดการนี้ฐานข้อมูล!";
/*     */       case 1030:
/* 239 */         return "ไม่สามารถสร้างเซสชั่นใหม่! ผู้ใช้ไม่สามารถเข้าสู่ระบบโหนดนี้!";
/*     */       case 1031:
/* 241 */         return "ตารางการปรับแต่งควรจะปรับ โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1032:
/* 243 */         return "ดูรายงานทำงานอยู่แล้ว กรุณาใช้ปุ่มเปิดเมื่อดูรายงานเพื่อดูรายงานอีก";
/*     */       case 1033:
/* 245 */         return "ข้อผิดพลาดการทำงานร่วมกันของลูกค้า โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1034:
/* 247 */         return "แพคเกจการปรับแต่งไม่ถูกต้อง โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 112:
/* 249 */         return "ลืมรหัสผ่านของคุณหรือไม่";
/*     */       case 113:
/* 251 */         return "ที่อยู่อีเมล์";
/*     */       case 114:
/* 253 */         return "ที่อยู่อีเมลไม่ถูกต้อง";
/*     */       case 115:
/* 255 */         return "ข้อมูลเข้าสู่ระบบของคุณถูกส่งไปยังที่อยู่อีเมลของคุณ";
/*     */       case 116:
/* 257 */         return "ที่อยู่อีเมลที่คุณระบุไม่พบระเบียนระบบของเรา \nกรุณาตรวจสอบที่อยู่อีเมลที่คุณระบุ";
/*     */       case 117:
/* 259 */         return "ยกเว้นที่ไม่คาดคิดเกิดขึ้นได้รับการ โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 118:
/* 261 */         return "ข้อมูล";
/*     */       case 1037:
/* 263 */         return "ที่ไม่ถูกต้องชื่อผู้ใช้ที่แตกต่างกันและ / หรือรหัสผ่าน โปรดติดต่อผู้ดูแลระบบของคุณ";
/*     */       case 1040:
/* 265 */         return "คำถามรักษาความปลอดภัยเป็นคำตอบที่ไม่ถูกต้อง โปรดลองอีกครั้ง";
/*     */     } 
/* 267 */     return super.getCultureResStr(cultureResID);
/*     */   }
/*     */ 
/*     */   
/*     */   public String getLanguageName(int language) {
/* 272 */     switch (language) {
/*     */       
/*     */       case 34:
/* 275 */         return "ชาวแอลเบเนีย";
/*     */       case 32:
/* 277 */         return "ภาษาอาหรับ (JO)";
/*     */       case 24:
/* 279 */         return "ภาษาอาหรับ (SA)";
/*     */       case 38:
/* 281 */         return "ภาษาอาหรับ (EG)";
/*     */       case 29:
/* 283 */         return "ชาวอาเซร์ไบจัน";
/*     */       case 28:
/* 285 */         return "บัลแกเรีย";
/*     */       case 17:
/* 287 */         return "จีน";
/*     */       case 27:
/* 289 */         return "โครเอเชีย";
/*     */       case 9:
/* 291 */         return "เช็";
/*     */       case 10:
/* 293 */         return "ภาษาเดนมาร์ก";
/*     */       case 11:
/* 295 */         return "ดัตช์";
/*     */       case 2:
/* 297 */         return "ภาษาอังกฤษ";
/*     */       case 40:
/* 299 */         return "ภาษาอังกฤษ (IN)";
/*     */       case 12:
/* 301 */         return "เอสโตเนีย";
/*     */       case 30:
/* 303 */         return "ชาวเปอร์เซีย";
/*     */       case 13:
/* 305 */         return "ฟินแลนด์";
/*     */       case 3:
/* 307 */         return "ฝรั่งเศส";
/*     */       case 4:
/* 309 */         return "ภาษาเยอรมัน";
/*     */       case 37:
/* 311 */         return "จอร์เจีย";
/*     */       case 23:
/* 313 */         return "กรีก";
/*     */       case 14:
/* 315 */         return "ชาวอิสราเอล";
/*     */       case 15:
/* 317 */         return "ชาวฮังการี";
/*     */       case 16:
/* 319 */         return "ไอซ์แลนด์";
/*     */       case 6:
/* 321 */         return "อิตาเลียน";
/*     */       case 18:
/* 323 */         return "ญี่ปุ่น";
/*     */       case 19:
/* 325 */         return "เกาหลี";
/*     */       case 20:
/* 327 */         return "ภาษานอร์เว";
/*     */       case 8:
/* 329 */         return "ขัด";
/*     */       case 21:
/* 331 */         return "ภาษาโปรตุเกส";
/*     */       case 25:
/* 333 */         return "โรมาเนีย";
/*     */       case 5:
/* 335 */         return "ภาษารัสเซีย";
/*     */       case 26:
/* 337 */         return "ชาวสโลเวเนีย";
/*     */       case 7:
/* 339 */         return "ษาสเปน";
/*     */       case 22:
/* 341 */         return "สวีเดน";
/*     */       case 35:
/* 343 */         return "ภาษาไทย";
/*     */       case 33:
/* 345 */         return "เติร์ก";
/*     */       case 31:
/* 347 */         return "ตุรกี (RTL)";
/*     */       case 1:
/* 349 */         return "ตุรกี";
/*     */       case 36:
/* 351 */         return "เวียตนาม";
/*     */     } 
/*     */     
/* 354 */     return "ภาษาที่ไม่รู้จัก";
/*     */   }
/*     */ 
/*     */   
/*     */   public int getCurrencyIdx() {
/* 359 */     return 140;
/*     */   }
/*     */ 
/*     */ 
/*     */   
/*     */   public Font getFont() {
/* 365 */     return new Font(ms_FontName, ms_FontStyle, ms_FontSize);
/*     */   }
/*     */ }


/* Location:              C:\Users\Furkan\Desktop\logo\Components.jar!\com\lbs\globalization\JLbsCultureInfoTHTH.class
 * Java compiler version: 8 (52.0)
 * JD-Core Version:       1.1.3
 */